# YOLOv9

# parameters
nc: 1  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors: 3

# gelan backbone
backbone:
  [
   # conv down
   [-1, 1, RepVGG, [64, 3, 2]],  # 0-P1/2

   # squeeze n excite
   [-1, 1, SEBlock, [64]],       # 1

   # New: RepVGG block
   [-1, 1, RepVGG, [64, 3, 1]],  # 2

   # New: squeeze n excite (SEBlock)
   [-1, 1, SEBlock, [64]],       # 3

   # New: RepVGG block
   [-1, 1, RepVGG, [64, 3, 1]],  # 4

   # New: squeeze n excite (SEBlock)
   [-1, 1, SEBlock, [64]],       # 5

   # conv down
   [-1, 1, RepVGG, [128, 3, 2]],  # 6-P2/4

   # New: squeeze n excite (SEBlock)
   [-1, 1, SEBlock, [128]],       # 7

   # New: RepVGG block
   [-1, 1, RepVGG, [128, 3, 2]],  # 8

   # squeeze n excite
   [-1, 1, SEBlock, [128]],       # 9

   # elan-1 block
   [-1, 1, RepNCSPELAN4, [256, 128, 64, 1]],  # 10

   # avg-conv down
   [-1, 1, ADown, [256]],  # 11-P3/8

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 256, 128, 1]],  # 12

   # avg-conv down
   [-1, 1, ADown, [512]],  # 13-P4/16

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  # 14

   # avg-conv down
   [-1, 1, ADown, [512]],  # 15-P5/32

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  # 16
  ]

# gelan head
head:
  [
   # elan-spp block
   [-1, 1, SPPELAN, [512, 256]],  # 17

   # up-concat merge
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 14], 1, Concat, [1]],  # cat backbone P4

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  # 20

   # up-concat merge
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 12], 1, Concat, [1]],  # cat backbone P3

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [256, 256, 128, 1]],  # 23 (P3/8-small)

   # squeeze n excite (SEBlock) between elan-2 block and avg-conv down
   [-1, 1, SEBlock, [256]],       # 24

   # avg-conv-down merge
   [-1, 1, ADown, [256]],
   [[-1, 20], 1, Concat, [1]],  # cat head P4

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  # 27 (P4/16-medium)

   # squeeze n excite (SEBlock) between elan-2 block and avg-conv down
   [-1, 1, SEBlock, [512]],       # 28

   # avg-conv-down merge
   [-1, 1, ADown, [512]],
   [[-1, 17], 1, Concat, [1]],  # cat head P5

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  # 31 (P5/32-large)

   # squeeze n excite (SEBlock) before detection
   [-1, 1, SEBlock, [512]],       # 32

   # detect
   [[23, 27, 31], 1, DDetect, [nc]],  # DDetect(P3, P4, P5)
  ]
