# YOLOv9

# parameters
nc: 1  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
#activation: nn.LeakyReLU(0.1)
#activation: nn.ReLU()

# anchors
anchors: 3

# gelan backbone
backbone:
  [
   # conv down
   [-1, 1, RepVGG, [64, 3, 2]],  # 0-P1/2

   # squeeze n excite
   [-1, 1, SEBlock, [64]],       # 1	

   # New: RepVGG block
   [-1, 1, RepVGG, [64, 3, 1]],  # 2

   # New: squeeze n excite (SEBlock)
   [-1, 1, SEBlock, [64]],       # 3

   # New: RepVGG block
   [-1, 1, RepVGG, [64, 3, 1]],  # 4

   # New: squeeze n excite (SEBlock)
   [-1, 1, SEBlock, [64]],       # 5

   # conv down
   [-1, 1, RepVGG, [128, 3, 2]],  # 6-P2/4

   # New: squeeze n excite (SEBlock)
   [-1, 1, SEBlock, [128]],       # 7

   # New: RepVGG block
   [-1, 1, RepVGG, [128, 3, 1]],  # 8

   # New: squeeze n excite (SEBlock)
   [-1, 1, SEBlock, [128]],       # 9

   # New: RepVGG block
   [-1, 1, RepVGG, [128, 3, 2]],  # 10

   # squeeze n excite
   [-1, 1, SEBlock, [128]],       # 11

   # elan-1 block
   [-1, 1, RepNCSPELAN4, [256, 128, 64, 1]],  # 12

   # squeeze n excite (SEBlock) between elan-1 block and avg-conv down
   [-1, 1, SEBlock, [256]],       # 13

   # New: RepVGG block
   [-1, 1, RepVGG, [256, 3, 1]],  # 14

   # New: squeeze n excite (SEBlock)
   [-1, 1, SEBlock, [256]],       # 15

   # avg-conv down
   [-1, 1, ADown, [256]],  # 16-P3/8

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 256, 128, 1]],  # 17

   # avg-conv down
   [-1, 1, ADown, [512]],  # 18-P4/16

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  # 19

   # avg-conv down
   [-1, 1, ADown, [512]],  # 20-P5/32

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  # 21
  ]

# gelan head
head:
  [
   # elan-spp block
   [-1, 1, SPPELAN, [512, 256]],  # 22

   # up-concat merge
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 19], 1, Concat, [1]],  # cat backbone P4

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  # 25

   # up-concat merge
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 17], 1, Concat, [1]],  # cat backbone P3

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [256, 256, 128, 1]],  # 28 (P3/8-small)

   # avg-conv-down merge
   [-1, 1, ADown, [256]],
   [[-1, 25], 1, Concat, [1]],  # cat head P4

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  # 31 (P4/16-medium)

   # avg-conv-down merge
   [-1, 1, ADown, [512]],
   [[-1, 22], 1, Concat, [1]],  # cat head P5

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  # 34 (P5/32-large)

   # detect
   [[28, 31, 34], 1, DDetect, [nc]],  # DDetect(P3, P4, P5)
  ]
